app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "director", "rating", "comments", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "Jake"], ["director", "Jake"], ["rating", 10], ["comments", "Good movie"], ["created_at", "2015-04-06 04:06:20.097645"], ["updated_at", "2015-04-06 04:06:20.097645"]]
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save